IvIePhisto/Dual-Strike/Firmware/Trunk/configuration_atmega168.h
#define CFG_MAME_BL4_MP_BUTTON5 (((config[14 + 2] >> 3) & 0b00000111)  == 0b101)
#define CFG_MAME_BL4_MP_BUTTON6 (((config[14 + 2] >> 3) & 0b00000111)  == 0b110)
#define CFG_MAME_BL4_HP_NOTHING ((((config[14 + 2] >> 6) & 0b00000001)  == 0b0) && (((config[15 + 2] >> 0) & 0b00000011)  == 0b00))
#define CFG_MAME_BL4_HP_BUTTON1 ((((config[14 + 2] >> 6) & 0b00000001)  == 0b1) && (((config[15 + 2] >> 0) & 0b00000011)  == 0b00))
#define CFG_MAME_BL4_HP_BUTTON2 ((((config[14 + 2] >> 6) & 0b00000001)  == 0b0) && (((config[15 + 2] >> 0) & 0b00000011)  == 0b01))
#define CFG_MAME_BL4_HP_BUTTON3 ((((config[14 + 2] >> 6) & 0b00000001)  == 0b1) && (((config[15 + 2] >> 0) & 0b00000011)  == 0b01))
#define CFG_MAME_BL4_HP_BUTTON4 ((((config[14 + 2] >> 6) & 0b00000001)  == 0b0) && (((config[15 + 2] >> 0) & 0b00000011)  == 0b10))
#define CFG_MAME_BL4_HP_BUTTON5 ((((config[14 + 2] >> 6) & 0b00000001)  == 0b1) && (((config[15 + 2] >> 0) & 0b00000011)  == 0b10))
#define CFG_MAME_BL4_HP_BUTTON6 ((((config[14 + 2] >> 6) & 0b00000001)  == 0b0) && (((config[15 + 2] >> 0) & 0b00000011)  == 0b11))
#define CFG_MAME_BL4_4P_NOTHING (((config[15 + 2] >> 2) & 0b00000111)  == 0b000)
#define CFG_MAME_BL4_4P_BUTTON1 (((config[15 + 2] >> 2) & 0b00000111)  == 0b001)
#define CFG_MAME_BL4_4P_BUTTON2 (((config[15 + 2] >> 2) & 0b00000111)  == 0b010)
#define CFG_MAME_BL4_4P_BUTTON3 (((config[15 + 2] >> 2) & 0b00000111)  == 0b011)
#define CFG_MAME_BL4_4P_BUTTON4 (((config[15 + 2] >> 2) & 0b00000111)  == 0b100)
#define CFG_MAME_BL4_4P_BUTTON5 (((config[15 + 2] >> 2) & 0b00000111)  == 0b101)
#define CFG_MAME_BL4_4P_BUTTON6 (((config[15 + 2] >> 2) & 0b00000111)  == 0b110)

/* CONFIG SETTERS: */
#define CFG_SET_DEF_WORK_MODE_PS3(CONFIG) CONFIG[0 + 2] &= ~(0b11 << 0);
#define CFG_SET_DEF_WORK_MODE_MAME(CONFIG) CONFIG[0 + 2] |= (0b01 << 0); CONFIG[0 + 2] &= ((0b01 << 0)| ~(0b10 << 0));
#define CFG_SET_DEF_WORK_MODE_XBOX(CONFIG) CONFIG[0 + 2] |= (0b10 << 0); CONFIG[0 + 2] &= ((0b10 << 0)| ~(0b01 << 0));
#define CFG_SET_DEF_WORK_MODE_PT(CONFIG) CONFIG[0 + 2] |= (0b11 << 0);
#define CFG_ENABLE_WORK_MODE_PS3_ENABLED(CONFIG) CONFIG[0 + 2] |= (1<<2);
#define CFG_DISABLE_WORK_MODE_PS3_ENABLED(CONFIG) CONFIG[0 + 2] &= ~(1<<2);
#define CFG_ENABLE_WORK_MODE_MAME_ENABLED(CONFIG) CONFIG[0 + 2] |= (1<<3);
#define CFG_DISABLE_WORK_MODE_MAME_ENABLED(CONFIG) CONFIG[0 + 2] &= ~(1<<3);
#define CFG_ENABLE_WORK_MODE_XBOX_ENABLED(CONFIG) CONFIG[0 + 2] |= (1<<4);
#define CFG_DISABLE_WORK_MODE_XBOX_ENABLED(CONFIG) CONFIG[0 + 2] &= ~(1<<4);
#define CFG_ENABLE_WORK_MODE_PT_ENABLED(CONFIG) CONFIG[0 + 2] |= (1<<5);
#define CFG_DISABLE_WORK_MODE_PT_ENABLED(CONFIG) CONFIG[0 + 2] &= ~(1<<5);
#define CFG_SET_DIGITAL_PAD(CONFIG) CONFIG[0 + 2] &= ~(0b1 << 6); CONFIG[1 + 2] &= ~(0b1 << 0);
#define CFG_SET_LEFT_STICK(CONFIG) CONFIG[0 + 2] |= (0b1 << 6); CONFIG[1 + 2] &= ~(0b1 << 0);
#define CFG_SET_RIGHT_STICK(CONFIG) CONFIG[0 + 2] &= ~(0b1 << 6); CONFIG[1 + 2] |= (0b1 << 0);
#define CFG_SET_MAME_DEFAULT_PLAYER_1(CONFIG) CONFIG[1 + 2] &= ~(0b1 << 1);
#define CFG_SET_MAME_DEFAULT_PLAYER_2(CONFIG) CONFIG[1 + 2] |= (0b1 << 1);
#define CFG_ENABLE_HOME_EMU(CONFIG) CONFIG[1 + 2] |= (1<<2);
#define CFG_DISABLE_HOME_EMU(CONFIG) CONFIG[1 + 2] &= ~(1<<2);
#define CFG_ENABLE_EMU_4X(CONFIG) CONFIG[1 + 2] |= (1<<3);
#define CFG_DISABLE_EMU_4X(CONFIG) CONFIG[1 + 2] &= ~(1<<3);
#define CFG_SET_NO_EXTRA_PINS(CONFIG) CONFIG[1 + 2] &= ~(0b111 << 4);
#define CFG_SET_JOYSTICK_SWITCH_READ_ACTIVE_LOW(CONFIG) CONFIG[1 + 2] |= (0b001 << 4); CONFIG[1 + 2] &= ((0b001 << 4)| ~(0b110 << 4));
#define CFG_SET_JOYSTICK_SWITCH_READ_ACTIVE_HIGH(CONFIG) CONFIG[1 + 2] |= (0b010 << 4); CONFIG[1 + 2] &= ((0b010 << 4)| ~(0b101 << 4));
#define CFG_SET_JOYSTICK_SWITCH_EMU(CONFIG) CONFIG[1 + 2] |= (0b011 << 4); CONFIG[1 + 2] &= ((0b011 << 4)| ~(0b100 << 4));
#define CFG_SET_INVERTED_TRIGGERS(CONFIG) CONFIG[1 + 2] |= (0b100 << 4); CONFIG[1 + 2] &= ((0b100 << 4)| ~(0b011 << 4));
#define CFG_SET_X3_READ(CONFIG) CONFIG[1 + 2] |= (0b101 << 4); CONFIG[1 + 2] &= ((0b101 << 4)| ~(0b010 << 4));
#define CFG_SET_MAME_BL1_LK_NOTHING(CONFIG) CONFIG[2 + 2] &= ~(0b111 << 0);
#define CFG_SET_MAME_BL1_LK_BUTTON1(CONFIG) CONFIG[2 + 2] |= (0b001 << 0); CONFIG[2 + 2] &= ((0b001 << 0)| ~(0b110 << 0));
#define CFG_SET_MAME_BL1_LK_BUTTON2(CONFIG) CONFIG[2 + 2] |= (0b010 << 0); CONFIG[2 + 2] &= ((0b010 << 0)| ~(0b101 << 0));
#define CFG_SET_MAME_BL1_LK_BUTTON3(CONFIG) CONFIG[2 + 2] |= (0b011 << 0); CONFIG[2 + 2] &= ((0b011 << 0)| ~(0b100 << 0));
#define CFG_SET_MAME_BL1_LK_BUTTON4(CONFIG) CONFIG[2 + 2] |= (0b100 << 0); CONFIG[2 + 2] &= ((0b100 << 0)| ~(0b011 << 0));
#define CFG_SET_MAME_BL1_LK_BUTTON5(CONFIG) CONFIG[2 + 2] |= (0b101 << 0); CONFIG[2 + 2] &= ((0b101 << 0)| ~(0b010 << 0));
#define CFG_SET_MAME_BL1_LK_BUTTON6(CONFIG) CONFIG[2 + 2] |= (0b110 << 0); CONFIG[2 + 2] &= ((0b110 << 0)| ~(0b001 << 0));
#define CFG_SET_MAME_BL1_MK_NOTHING(CONFIG) CONFIG[2 + 2] &= ~(0b111 << 3);
#define CFG_SET_MAME_BL1_MK_BUTTON1(CONFIG) CONFIG[2 + 2] |= (0b001 << 3); CONFIG[2 + 2] &= ((0b001 << 3)| ~(0b110 << 3));
#define CFG_SET_MAME_BL1_MK_BUTTON2(CONFIG) CONFIG[2 + 2] |= (0b010 << 3); CONFIG[2 + 2] &= ((0b010 << 3)| ~(0b101 << 3));
#define CFG_SET_MAME_BL1_MK_BUTTON3(CONFIG) CONFIG[2 + 2] |= (0b011 << 3); CONFIG[2 + 2] &= ((0b011 << 3)| ~(0b100 << 3));
#define CFG_SET_MAME_BL1_MK_BUTTON4(CONFIG) CONFIG[2 + 2] |= (0b100 << 3); CONFIG[2 + 2] &= ((0b100 << 3)| ~(0b011 << 3));
#define CFG_SET_MAME_BL1_MK_BUTTON5(CONFIG) CONFIG[2 + 2] |= (0b101 << 3); CONFIG[2 + 2] &= ((0b101 << 3)| ~(0b010 << 3));
#define CFG_SET_MAME_BL1_MK_BUTTON6(CONFIG) CONFIG[2 + 2] |= (0b110 << 3); CONFIG[2 + 2] &= ((0b110 << 3)| ~(0b001 << 3));
#define CFG_SET_MAME_BL1_HK_NOTHING(CONFIG) CONFIG[2 + 2] &= ~(0b1 << 6); CONFIG[3 + 2] &= ~(0b11 << 0);
#define CFG_SET_MAME_BL1_HK_BUTTON1(CONFIG) CONFIG[2 + 2] |= (0b1 << 6); CONFIG[3 + 2] &= ~(0b11 << 0);
#define CFG_SET_MAME_BL1_HK_BUTTON2(CONFIG) CONFIG[2 + 2] &= ~(0b1 << 6); CONFIG[3 + 2] |= (0b01 << 0); CONFIG[3 + 2] &= ((0b01 << 0)| ~(0b10 << 0));
#define CFG_SET_MAME_BL1_HK_BUTTON3(CONFIG) CONFIG[2 + 2] |= (0b1 << 6); CONFIG[3 + 2] |= (0b01 << 0); CONFIG[3 + 2] &= ((0b01 << 0)| ~(0b10 << 0));
#define CFG_SET_MAME_BL1_HK_BUTTON4(CONFIG) CONFIG[2 + 2] &= ~(0b1 << 6); CONFIG[3 + 2] |= (0b10 << 0); CONFIG[3 + 2] &= ((0b10 << 0)| ~(0b01 << 0));
#define CFG_SET_MAME_BL1_HK_BUTTON5(CONFIG) CONFIG[2 + 2] |= (0b1 << 6); CONFIG[3 + 2] |= (0b10 << 0); CONFIG[3 + 2] &= ((0b10 << 0)| ~(0b01 << 0));
#define CFG_SET_MAME_BL1_HK_BUTTON6(CONFIG) CONFIG[2 + 2] &= ~(0b1 << 6); CONFIG[3 + 2] |= (0b11 << 0);
#define CFG_SET_MAME_BL1_4K_NOTHING(CONFIG) CONFIG[3 + 2] &= ~(0b111 << 2);
#define CFG_SET_MAME_BL1_4K_BUTTON1(CONFIG) CONFIG[3 + 2] |= (0b001 << 2); CONFIG[3 + 2] &= ((0b001 << 2)| ~(0b110 << 2));
#define CFG_SET_MAME_BL1_4K_BUTTON2(CONFIG) CONFIG[3 + 2] |= (0b010 << 2); CONFIG[3 + 2] &= ((0b010 << 2)| ~(0b101 << 2));
#define CFG_SET_MAME_BL1_4K_BUTTON3(CONFIG) CONFIG[3 + 2] |= (0b011 << 2); CONFIG[3 + 2] &= ((0b011 << 2)| ~(0b100 << 2));
#define CFG_SET_MAME_BL1_4K_BUTTON4(CONFIG) CONFIG[3 + 2] |= (0b100 << 2); CONFIG[3 + 2] &= ((0b100 << 2)| ~(0b011 << 2));
#define CFG_SET_MAME_BL1_4K_BUTTON5(CONFIG) CONFIG[3 + 2] |= (0b101 << 2); CONFIG[3 + 2] &= ((0b101 << 2)| ~(0b010 << 2));
#define CFG_SET_MAME_BL1_4K_BUTTON6(CONFIG) CONFIG[3 + 2] |= (0b110 << 2); CONFIG[3 + 2] &= ((0b110 << 2)| ~(0b001 << 2));
#define CFG_SET_MAME_BL1_LP_NOTHING(CONFIG) CONFIG[3 + 2] &= ~(0b11 << 5); CONFIG[4 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL1_LP_BUTTON1(CONFIG) CONFIG[3 + 2] |= (0b01 << 5); CONFIG[3 + 2] &= ((0b01 << 5)| ~(0b10 << 5)); CONFIG[4 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL1_LP_BUTTON2(CONFIG) CONFIG[3 + 2] |= (0b10 << 5); CONFIG[3 + 2] &= ((0b10 << 5)| ~(0b01 << 5)); CONFIG[4 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL1_LP_BUTTON3(CONFIG) CONFIG[3 + 2] |= (0b11 << 5); CONFIG[4 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL1_LP_BUTTON4(CONFIG) CONFIG[3 + 2] &= ~(0b11 << 5); CONFIG[4 + 2] |= (0b1 << 0);
#define CFG_SET_MAME_BL1_LP_BUTTON5(CONFIG) CONFIG[3 + 2] |= (0b01 << 5); CONFIG[3 + 2] &= ((0b01 << 5)| ~(0b10 << 5)); CONFIG[4 + 2] |= (0b1 << 0);
#define CFG_SET_MAME_BL1_LP_BUTTON6(CONFIG) CONFIG[3 + 2] |= (0b10 << 5); CONFIG[3 + 2] &= ((0b10 << 5)| ~(0b01 << 5)); CONFIG[4 + 2] |= (0b1 << 0);
#define CFG_SET_MAME_BL1_MP_NOTHING(CONFIG) CONFIG[4 + 2] &= ~(0b111 << 1);
#define CFG_SET_MAME_BL1_MP_BUTTON1(CONFIG) CONFIG[4 + 2] |= (0b001 << 1); CONFIG[4 + 2] &= ((0b001 << 1)| ~(0b110 << 1));
#define CFG_SET_MAME_BL1_MP_BUTTON2(CONFIG) CONFIG[4 + 2] |= (0b010 << 1); CONFIG[4 + 2] &= ((0b010 << 1)| ~(0b101 << 1));
#define CFG_SET_MAME_BL1_MP_BUTTON3(CONFIG) CONFIG[4 + 2] |= (0b011 << 1); CONFIG[4 + 2] &= ((0b011 << 1)| ~(0b100 << 1));
#define CFG_SET_MAME_BL1_MP_BUTTON4(CONFIG) CONFIG[4 + 2] |= (0b100 << 1); CONFIG[4 + 2] &= ((0b100 << 1)| ~(0b011 << 1));
#define CFG_SET_MAME_BL1_MP_BUTTON5(CONFIG) CONFIG[4 + 2] |= (0b101 << 1); CONFIG[4 + 2] &= ((0b101 << 1)| ~(0b010 << 1));
#define CFG_SET_MAME_BL1_MP_BUTTON6(CONFIG) CONFIG[4 + 2] |= (0b110 << 1); CONFIG[4 + 2] &= ((0b110 << 1)| ~(0b001 << 1));
#define CFG_SET_MAME_BL1_HP_NOTHING(CONFIG) CONFIG[4 + 2] &= ~(0b111 << 4);
#define CFG_SET_MAME_BL1_HP_BUTTON1(CONFIG) CONFIG[4 + 2] |= (0b001 << 4); CONFIG[4 + 2] &= ((0b001 << 4)| ~(0b110 << 4));
#define CFG_SET_MAME_BL1_HP_BUTTON2(CONFIG) CONFIG[4 + 2] |= (0b010 << 4); CONFIG[4 + 2] &= ((0b010 << 4)| ~(0b101 << 4));
#define CFG_SET_MAME_BL1_HP_BUTTON3(CONFIG) CONFIG[4 + 2] |= (0b011 << 4); CONFIG[4 + 2] &= ((0b011 << 4)| ~(0b100 << 4));
#define CFG_SET_MAME_BL1_HP_BUTTON4(CONFIG) CONFIG[4 + 2] |= (0b100 << 4); CONFIG[4 + 2] &= ((0b100 << 4)| ~(0b011 << 4));
#define CFG_SET_MAME_BL1_HP_BUTTON5(CONFIG) CONFIG[4 + 2] |= (0b101 << 4); CONFIG[4 + 2] &= ((0b101 << 4)| ~(0b010 << 4));
#define CFG_SET_MAME_BL1_HP_BUTTON6(CONFIG) CONFIG[4 + 2] |= (0b110 << 4); CONFIG[4 + 2] &= ((0b110 << 4)| ~(0b001 << 4));
#define CFG_SET_MAME_BL1_4P_NOTHING(CONFIG) CONFIG[5 + 2] &= ~(0b111 << 0);
#define CFG_SET_MAME_BL1_4P_BUTTON1(CONFIG) CONFIG[5 + 2] |= (0b001 << 0); CONFIG[5 + 2] &= ((0b001 << 0)| ~(0b110 << 0));
#define CFG_SET_MAME_BL1_4P_BUTTON2(CONFIG) CONFIG[5 + 2] |= (0b010 << 0); CONFIG[5 + 2] &= ((0b010 << 0)| ~(0b101 << 0));
#define CFG_SET_MAME_BL1_4P_BUTTON3(CONFIG) CONFIG[5 + 2] |= (0b011 << 0); CONFIG[5 + 2] &= ((0b011 << 0)| ~(0b100 << 0));
#define CFG_SET_MAME_BL1_4P_BUTTON4(CONFIG) CONFIG[5 + 2] |= (0b100 << 0); CONFIG[5 + 2] &= ((0b100 << 0)| ~(0b011 << 0));
#define CFG_SET_MAME_BL1_4P_BUTTON5(CONFIG) CONFIG[5 + 2] |= (0b101 << 0); CONFIG[5 + 2] &= ((0b101 << 0)| ~(0b010 << 0));
#define CFG_SET_MAME_BL1_4P_BUTTON6(CONFIG) CONFIG[5 + 2] |= (0b110 << 0); CONFIG[5 + 2] &= ((0b110 << 0)| ~(0b001 << 0));
#define CFG_SET_MAME_BL2_LK_NOTHING(CONFIG) CONFIG[5 + 2] &= ~(0b111 << 3);
#define CFG_SET_MAME_BL2_LK_BUTTON1(CONFIG) CONFIG[5 + 2] |= (0b001 << 3); CONFIG[5 + 2] &= ((0b001 << 3)| ~(0b110 << 3));
#define CFG_SET_MAME_BL2_LK_BUTTON2(CONFIG) CONFIG[5 + 2] |= (0b010 << 3); CONFIG[5 + 2] &= ((0b010 << 3)| ~(0b101 << 3));
#define CFG_SET_MAME_BL2_LK_BUTTON3(CONFIG) CONFIG[5 + 2] |= (0b011 << 3); CONFIG[5 + 2] &= ((0b011 << 3)| ~(0b100 << 3));
#define CFG_SET_MAME_BL2_LK_BUTTON4(CONFIG) CONFIG[5 + 2] |= (0b100 << 3); CONFIG[5 + 2] &= ((0b100 << 3)| ~(0b011 << 3));
#define CFG_SET_MAME_BL2_LK_BUTTON5(CONFIG) CONFIG[5 + 2] |= (0b101 << 3); CONFIG[5 + 2] &= ((0b101 << 3)| ~(0b010 << 3));
#define CFG_SET_MAME_BL2_LK_BUTTON6(CONFIG) CONFIG[5 + 2] |= (0b110 << 3); CONFIG[5 + 2] &= ((0b110 << 3)| ~(0b001 << 3));
#define CFG_SET_MAME_BL2_MK_NOTHING(CONFIG) CONFIG[5 + 2] &= ~(0b1 << 6); CONFIG[6 + 2] &= ~(0b11 << 0);
#define CFG_SET_MAME_BL2_MK_BUTTON1(CONFIG) CONFIG[5 + 2] |= (0b1 << 6); CONFIG[6 + 2] &= ~(0b11 << 0);
#define CFG_SET_MAME_BL2_MK_BUTTON2(CONFIG) CONFIG[5 + 2] &= ~(0b1 << 6); CONFIG[6 + 2] |= (0b01 << 0); CONFIG[6 + 2] &= ((0b01 << 0)| ~(0b10 << 0));
#define CFG_SET_MAME_BL2_MK_BUTTON3(CONFIG) CONFIG[5 + 2] |= (0b1 << 6); CONFIG[6 + 2] |= (0b01 << 0); CONFIG[6 + 2] &= ((0b01 << 0)| ~(0b10 << 0));
#define CFG_SET_MAME_BL2_MK_BUTTON4(CONFIG) CONFIG[5 + 2] &= ~(0b1 << 6); CONFIG[6 + 2] |= (0b10 << 0); CONFIG[6 + 2] &= ((0b10 << 0)| ~(0b01 << 0));
#define CFG_SET_MAME_BL2_MK_BUTTON5(CONFIG) CONFIG[5 + 2] |= (0b1 << 6); CONFIG[6 + 2] |= (0b10 << 0); CONFIG[6 + 2] &= ((0b10 << 0)| ~(0b01 << 0));
#define CFG_SET_MAME_BL2_MK_BUTTON6(CONFIG) CONFIG[5 + 2] &= ~(0b1 << 6); CONFIG[6 + 2] |= (0b11 << 0);
#define CFG_SET_MAME_BL2_HK_NOTHING(CONFIG) CONFIG[6 + 2] &= ~(0b111 << 2);
#define CFG_SET_MAME_BL2_HK_BUTTON1(CONFIG) CONFIG[6 + 2] |= (0b001 << 2); CONFIG[6 + 2] &= ((0b001 << 2)| ~(0b110 << 2));
#define CFG_SET_MAME_BL2_HK_BUTTON2(CONFIG) CONFIG[6 + 2] |= (0b010 << 2); CONFIG[6 + 2] &= ((0b010 << 2)| ~(0b101 << 2));
#define CFG_SET_MAME_BL2_HK_BUTTON3(CONFIG) CONFIG[6 + 2] |= (0b011 << 2); CONFIG[6 + 2] &= ((0b011 << 2)| ~(0b100 << 2));
#define CFG_SET_MAME_BL2_HK_BUTTON4(CONFIG) CONFIG[6 + 2] |= (0b100 << 2); CONFIG[6 + 2] &= ((0b100 << 2)| ~(0b011 << 2));
#define CFG_SET_MAME_BL2_HK_BUTTON5(CONFIG) CONFIG[6 + 2] |= (0b101 << 2); CONFIG[6 + 2] &= ((0b101 << 2)| ~(0b010 << 2));
#define CFG_SET_MAME_BL2_HK_BUTTON6(CONFIG) CONFIG[6 + 2] |= (0b110 << 2); CONFIG[6 + 2] &= ((0b110 << 2)| ~(0b001 << 2));
#define CFG_SET_MAME_BL2_4K_NOTHING(CONFIG) CONFIG[6 + 2] &= ~(0b11 << 5); CONFIG[7 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL2_4K_BUTTON1(CONFIG) CONFIG[6 + 2] |= (0b01 << 5); CONFIG[6 + 2] &= ((0b01 << 5)| ~(0b10 << 5)); CONFIG[7 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL2_4K_BUTTON2(CONFIG) CONFIG[6 + 2] |= (0b10 << 5); CONFIG[6 + 2] &= ((0b10 << 5)| ~(0b01 << 5)); CONFIG[7 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL2_4K_BUTTON3(CONFIG) CONFIG[6 + 2] |= (0b11 << 5); CONFIG[7 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL2_4K_BUTTON4(CONFIG) CONFIG[6 + 2] &= ~(0b11 << 5); CONFIG[7 + 2] |= (0b1 << 0);
#define CFG_SET_MAME_BL2_4K_BUTTON5(CONFIG) CONFIG[6 + 2] |= (0b01 << 5); CONFIG[6 + 2] &= ((0b01 << 5)| ~(0b10 << 5)); CONFIG[7 + 2] |= (0b1 << 0);
#define CFG_SET_MAME_BL2_4K_BUTTON6(CONFIG) CONFIG[6 + 2] |= (0b10 << 5); CONFIG[6 + 2] &= ((0b10 << 5)| ~(0b01 << 5)); CONFIG[7 + 2] |= (0b1 << 0);
#define CFG_SET_MAME_BL2_LP_NOTHING(CONFIG) CONFIG[7 + 2] &= ~(0b111 << 1);
#define CFG_SET_MAME_BL2_LP_BUTTON1(CONFIG) CONFIG[7 + 2] |= (0b001 << 1); CONFIG[7 + 2] &= ((0b001 << 1)| ~(0b110 << 1));
#define CFG_SET_MAME_BL2_LP_BUTTON2(CONFIG) CONFIG[7 + 2] |= (0b010 << 1); CONFIG[7 + 2] &= ((0b010 << 1)| ~(0b101 << 1));
#define CFG_SET_MAME_BL2_LP_BUTTON3(CONFIG) CONFIG[7 + 2] |= (0b011 << 1); CONFIG[7 + 2] &= ((0b011 << 1)| ~(0b100 << 1));
#define CFG_SET_MAME_BL2_LP_BUTTON4(CONFIG) CONFIG[7 + 2] |= (0b100 << 1); CONFIG[7 + 2] &= ((0b100 << 1)| ~(0b011 << 1));
#define CFG_SET_MAME_BL2_LP_BUTTON5(CONFIG) CONFIG[7 + 2] |= (0b101 << 1); CONFIG[7 + 2] &= ((0b101 << 1)| ~(0b010 << 1));
#define CFG_SET_MAME_BL2_LP_BUTTON6(CONFIG) CONFIG[7 + 2] |= (0b110 << 1); CONFIG[7 + 2] &= ((0b110 << 1)| ~(0b001 << 1));
#define CFG_SET_MAME_BL2_MP_NOTHING(CONFIG) CONFIG[7 + 2] &= ~(0b111 << 4);
#define CFG_SET_MAME_BL2_MP_BUTTON1(CONFIG) CONFIG[7 + 2] |= (0b001 << 4); CONFIG[7 + 2] &= ((0b001 << 4)| ~(0b110 << 4));
#define CFG_SET_MAME_BL2_MP_BUTTON2(CONFIG) CONFIG[7 + 2] |= (0b010 << 4); CONFIG[7 + 2] &= ((0b010 << 4)| ~(0b101 << 4));
#define CFG_SET_MAME_BL2_MP_BUTTON3(CONFIG) CONFIG[7 + 2] |= (0b011 << 4); CONFIG[7 + 2] &= ((0b011 << 4)| ~(0b100 << 4));
#define CFG_SET_MAME_BL2_MP_BUTTON4(CONFIG) CONFIG[7 + 2] |= (0b100 << 4); CONFIG[7 + 2] &= ((0b100 << 4)| ~(0b011 << 4));
#define CFG_SET_MAME_BL2_MP_BUTTON5(CONFIG) CONFIG[7 + 2] |= (0b101 << 4); CONFIG[7 + 2] &= ((0b101 << 4)| ~(0b010 << 4));
#define CFG_SET_MAME_BL2_MP_BUTTON6(CONFIG) CONFIG[7 + 2] |= (0b110 << 4); CONFIG[7 + 2] &= ((0b110 << 4)| ~(0b001 << 4));
#define CFG_SET_MAME_BL2_HP_NOTHING(CONFIG) CONFIG[8 + 2] &= ~(0b111 << 0);
#define CFG_SET_MAME_BL2_HP_BUTTON1(CONFIG) CONFIG[8 + 2] |= (0b001 << 0); CONFIG[8 + 2] &= ((0b001 << 0)| ~(0b110 << 0));
#define CFG_SET_MAME_BL2_HP_BUTTON2(CONFIG) CONFIG[8 + 2] |= (0b010 << 0); CONFIG[8 + 2] &= ((0b010 << 0)| ~(0b101 << 0));
#define CFG_SET_MAME_BL2_HP_BUTTON3(CONFIG) CONFIG[8 + 2] |= (0b011 << 0); CONFIG[8 + 2] &= ((0b011 << 0)| ~(0b100 << 0));
#define CFG_SET_MAME_BL2_HP_BUTTON4(CONFIG) CONFIG[8 + 2] |= (0b100 << 0); CONFIG[8 + 2] &= ((0b100 << 0)| ~(0b011 << 0));
#define CFG_SET_MAME_BL2_HP_BUTTON5(CONFIG) CONFIG[8 + 2] |= (0b101 << 0); CONFIG[8 + 2] &= ((0b101 << 0)| ~(0b010 << 0));
#define CFG_SET_MAME_BL2_HP_BUTTON6(CONFIG) CONFIG[8 + 2] |= (0b110 << 0); CONFIG[8 + 2] &= ((0b110 << 0)| ~(0b001 << 0));
#define CFG_SET_MAME_BL2_4P_NOTHING(CONFIG) CONFIG[8 + 2] &= ~(0b111 << 3);
#define CFG_SET_MAME_BL2_4P_BUTTON1(CONFIG) CONFIG[8 + 2] |= (0b001 << 3); CONFIG[8 + 2] &= ((0b001 << 3)| ~(0b110 << 3));
#define CFG_SET_MAME_BL2_4P_BUTTON2(CONFIG) CONFIG[8 + 2] |= (0b010 << 3); CONFIG[8 + 2] &= ((0b010 << 3)| ~(0b101 << 3));
#define CFG_SET_MAME_BL2_4P_BUTTON3(CONFIG) CONFIG[8 + 2] |= (0b011 << 3); CONFIG[8 + 2] &= ((0b011 << 3)| ~(0b100 << 3));
#define CFG_SET_MAME_BL2_4P_BUTTON4(CONFIG) CONFIG[8 + 2] |= (0b100 << 3); CONFIG[8 + 2] &= ((0b100 << 3)| ~(0b011 << 3));
#define CFG_SET_MAME_BL2_4P_BUTTON5(CONFIG) CONFIG[8 + 2] |= (0b101 << 3); CONFIG[8 + 2] &= ((0b101 << 3)| ~(0b010 << 3));
#define CFG_SET_MAME_BL2_4P_BUTTON6(CONFIG) CONFIG[8 + 2] |= (0b110 << 3); CONFIG[8 + 2] &= ((0b110 << 3)| ~(0b001 << 3));
#define CFG_SET_MAME_BL3_LK_NOTHING(CONFIG) CONFIG[8 + 2] &= ~(0b1 << 6); CONFIG[9 + 2] &= ~(0b11 << 0);
#define CFG_SET_MAME_BL3_LK_BUTTON1(CONFIG) CONFIG[8 + 2] |= (0b1 << 6); CONFIG[9 + 2] &= ~(0b11 << 0);
#define CFG_SET_MAME_BL3_LK_BUTTON2(CONFIG) CONFIG[8 + 2] &= ~(0b1 << 6); CONFIG[9 + 2] |= (0b01 << 0); CONFIG[9 + 2] &= ((0b01 << 0)| ~(0b10 << 0));
#define CFG_SET_MAME_BL3_LK_BUTTON3(CONFIG) CONFIG[8 + 2] |= (0b1 << 6); CONFIG[9 + 2] |= (0b01 << 0); CONFIG[9 + 2] &= ((0b01 << 0)| ~(0b10 << 0));
#define CFG_SET_MAME_BL3_LK_BUTTON4(CONFIG) CONFIG[8 + 2] &= ~(0b1 << 6); CONFIG[9 + 2] |= (0b10 << 0); CONFIG[9 + 2] &= ((0b10 << 0)| ~(0b01 << 0));
#define CFG_SET_MAME_BL3_LK_BUTTON5(CONFIG) CONFIG[8 + 2] |= (0b1 << 6); CONFIG[9 + 2] |= (0b10 << 0); CONFIG[9 + 2] &= ((0b10 << 0)| ~(0b01 << 0));
#define CFG_SET_MAME_BL3_LK_BUTTON6(CONFIG) CONFIG[8 + 2] &= ~(0b1 << 6); CONFIG[9 + 2] |= (0b11 << 0);
#define CFG_SET_MAME_BL3_MK_NOTHING(CONFIG) CONFIG[9 + 2] &= ~(0b111 << 2);
#define CFG_SET_MAME_BL3_MK_BUTTON1(CONFIG) CONFIG[9 + 2] |= (0b001 << 2); CONFIG[9 + 2] &= ((0b001 << 2)| ~(0b110 << 2));
#define CFG_SET_MAME_BL3_MK_BUTTON2(CONFIG) CONFIG[9 + 2] |= (0b010 << 2); CONFIG[9 + 2] &= ((0b010 << 2)| ~(0b101 << 2));
#define CFG_SET_MAME_BL3_MK_BUTTON3(CONFIG) CONFIG[9 + 2] |= (0b011 << 2); CONFIG[9 + 2] &= ((0b011 << 2)| ~(0b100 << 2));
#define CFG_SET_MAME_BL3_MK_BUTTON4(CONFIG) CONFIG[9 + 2] |= (0b100 << 2); CONFIG[9 + 2] &= ((0b100 << 2)| ~(0b011 << 2));
#define CFG_SET_MAME_BL3_MK_BUTTON5(CONFIG) CONFIG[9 + 2] |= (0b101 << 2); CONFIG[9 + 2] &= ((0b101 << 2)| ~(0b010 << 2));
#define CFG_SET_MAME_BL3_MK_BUTTON6(CONFIG) CONFIG[9 + 2] |= (0b110 << 2); CONFIG[9 + 2] &= ((0b110 << 2)| ~(0b001 << 2));
#define CFG_SET_MAME_BL3_HK_NOTHING(CONFIG) CONFIG[9 + 2] &= ~(0b11 << 5); CONFIG[10 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL3_HK_BUTTON1(CONFIG) CONFIG[9 + 2] |= (0b01 << 5); CONFIG[9 + 2] &= ((0b01 << 5)| ~(0b10 << 5)); CONFIG[10 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL3_HK_BUTTON2(CONFIG) CONFIG[9 + 2] |= (0b10 << 5); CONFIG[9 + 2] &= ((0b10 << 5)| ~(0b01 << 5)); CONFIG[10 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL3_HK_BUTTON3(CONFIG) CONFIG[9 + 2] |= (0b11 << 5); CONFIG[10 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL3_HK_BUTTON4(CONFIG) CONFIG[9 + 2] &= ~(0b11 << 5); CONFIG[10 + 2] |= (0b1 << 0);
#define CFG_SET_MAME_BL3_HK_BUTTON5(CONFIG) CONFIG[9 + 2] |= (0b01 << 5); CONFIG[9 + 2] &= ((0b01 << 5)| ~(0b10 << 5)); CONFIG[10 + 2] |= (0b1 << 0);
#define CFG_SET_MAME_BL3_HK_BUTTON6(CONFIG) CONFIG[9 + 2] |= (0b10 << 5); CONFIG[9 + 2] &= ((0b10 << 5)| ~(0b01 << 5)); CONFIG[10 + 2] |= (0b1 << 0);
#define CFG_SET_MAME_BL3_4K_NOTHING(CONFIG) CONFIG[10 + 2] &= ~(0b111 << 1);
#define CFG_SET_MAME_BL3_4K_BUTTON1(CONFIG) CONFIG[10 + 2] |= (0b001 << 1); CONFIG[10 + 2] &= ((0b001 << 1)| ~(0b110 << 1));
#define CFG_SET_MAME_BL3_4K_BUTTON2(CONFIG) CONFIG[10 + 2] |= (0b010 << 1); CONFIG[10 + 2] &= ((0b010 << 1)| ~(0b101 << 1));
#define CFG_SET_MAME_BL3_4K_BUTTON3(CONFIG) CONFIG[10 + 2] |= (0b011 << 1); CONFIG[10 + 2] &= ((0b011 << 1)| ~(0b100 << 1));
#define CFG_SET_MAME_BL3_4K_BUTTON4(CONFIG) CONFIG[10 + 2] |= (0b100 << 1); CONFIG[10 + 2] &= ((0b100 << 1)| ~(0b011 << 1));
#define CFG_SET_MAME_BL3_4K_BUTTON5(CONFIG) CONFIG[10 + 2] |= (0b101 << 1); CONFIG[10 + 2] &= ((0b101 << 1)| ~(0b010 << 1));
#define CFG_SET_MAME_BL3_4K_BUTTON6(CONFIG) CONFIG[10 + 2] |= (0b110 << 1); CONFIG[10 + 2] &= ((0b110 << 1)| ~(0b001 << 1));
#define CFG_SET_MAME_BL3_LP_NOTHING(CONFIG) CONFIG[10 + 2] &= ~(0b111 << 4);
#define CFG_SET_MAME_BL3_LP_BUTTON1(CONFIG) CONFIG[10 + 2] |= (0b001 << 4); CONFIG[10 + 2] &= ((0b001 << 4)| ~(0b110 << 4));
#define CFG_SET_MAME_BL3_LP_BUTTON2(CONFIG) CONFIG[10 + 2] |= (0b010 << 4); CONFIG[10 + 2] &= ((0b010 << 4)| ~(0b101 << 4));
#define CFG_SET_MAME_BL3_LP_BUTTON3(CONFIG) CONFIG[10 + 2] |= (0b011 << 4); CONFIG[10 + 2] &= ((0b011 << 4)| ~(0b100 << 4));
#define CFG_SET_MAME_BL3_LP_BUTTON4(CONFIG) CONFIG[10 + 2] |= (0b100 << 4); CONFIG[10 + 2] &= ((0b100 << 4)| ~(0b011 << 4));
#define CFG_SET_MAME_BL3_LP_BUTTON5(CONFIG) CONFIG[10 + 2] |= (0b101 << 4); CONFIG[10 + 2] &= ((0b101 << 4)| ~(0b010 << 4));
#define CFG_SET_MAME_BL3_LP_BUTTON6(CONFIG) CONFIG[10 + 2] |= (0b110 << 4); CONFIG[10 + 2] &= ((0b110 << 4)| ~(0b001 << 4));
#define CFG_SET_MAME_BL3_MP_NOTHING(CONFIG) CONFIG[11 + 2] &= ~(0b111 << 0);
#define CFG_SET_MAME_BL3_MP_BUTTON1(CONFIG) CONFIG[11 + 2] |= (0b001 << 0); CONFIG[11 + 2] &= ((0b001 << 0)| ~(0b110 << 0));
#define CFG_SET_MAME_BL3_MP_BUTTON2(CONFIG) CONFIG[11 + 2] |= (0b010 << 0); CONFIG[11 + 2] &= ((0b010 << 0)| ~(0b101 << 0));
#define CFG_SET_MAME_BL3_MP_BUTTON3(CONFIG) CONFIG[11 + 2] |= (0b011 << 0); CONFIG[11 + 2] &= ((0b011 << 0)| ~(0b100 << 0));
#define CFG_SET_MAME_BL3_MP_BUTTON4(CONFIG) CONFIG[11 + 2] |= (0b100 << 0); CONFIG[11 + 2] &= ((0b100 << 0)| ~(0b011 << 0));
#define CFG_SET_MAME_BL3_MP_BUTTON5(CONFIG) CONFIG[11 + 2] |= (0b101 << 0); CONFIG[11 + 2] &= ((0b101 << 0)| ~(0b010 << 0));
#define CFG_SET_MAME_BL3_MP_BUTTON6(CONFIG) CONFIG[11 + 2] |= (0b110 << 0); CONFIG[11 + 2] &= ((0b110 << 0)| ~(0b001 << 0));
#define CFG_SET_MAME_BL3_HP_NOTHING(CONFIG) CONFIG[11 + 2] &= ~(0b111 << 3);
#define CFG_SET_MAME_BL3_HP_BUTTON1(CONFIG) CONFIG[11 + 2] |= (0b001 << 3); CONFIG[11 + 2] &= ((0b001 << 3)| ~(0b110 << 3));
#define CFG_SET_MAME_BL3_HP_BUTTON2(CONFIG) CONFIG[11 + 2] |= (0b010 << 3); CONFIG[11 + 2] &= ((0b010 << 3)| ~(0b101 << 3));
#define CFG_SET_MAME_BL3_HP_BUTTON3(CONFIG) CONFIG[11 + 2] |= (0b011 << 3); CONFIG[11 + 2] &= ((0b011 << 3)| ~(0b100 << 3));
#define CFG_SET_MAME_BL3_HP_BUTTON4(CONFIG) CONFIG[11 + 2] |= (0b100 << 3); CONFIG[11 + 2] &= ((0b100 << 3)| ~(0b011 << 3));
#define CFG_SET_MAME_BL3_HP_BUTTON5(CONFIG) CONFIG[11 + 2] |= (0b101 << 3); CONFIG[11 + 2] &= ((0b101 << 3)| ~(0b010 << 3));
#define CFG_SET_MAME_BL3_HP_BUTTON6(CONFIG) CONFIG[11 + 2] |= (0b110 << 3); CONFIG[11 + 2] &= ((0b110 << 3)| ~(0b001 << 3));
#define CFG_SET_MAME_BL3_4P_NOTHING(CONFIG) CONFIG[11 + 2] &= ~(0b1 << 6); CONFIG[12 + 2] &= ~(0b11 << 0);
#define CFG_SET_MAME_BL3_4P_BUTTON1(CONFIG) CONFIG[11 + 2] |= (0b1 << 6); CONFIG[12 + 2] &= ~(0b11 << 0);
#define CFG_SET_MAME_BL3_4P_BUTTON2(CONFIG) CONFIG[11 + 2] &= ~(0b1 << 6); CONFIG[12 + 2] |= (0b01 << 0); CONFIG[12 + 2] &= ((0b01 << 0)| ~(0b10 << 0));
