IvIePhisto/Dual-Strike/Firmware/Trunk/configuration_atmega168.h
#define CFG_SET_MAME_BL3_4P_BUTTON3(CONFIG) CONFIG[11 + 2] |= (0b1 << 6); CONFIG[12 + 2] |= (0b01 << 0); CONFIG[12 + 2] &= ((0b01 << 0)| ~(0b10 << 0));
#define CFG_SET_MAME_BL3_4P_BUTTON4(CONFIG) CONFIG[11 + 2] &= ~(0b1 << 6); CONFIG[12 + 2] |= (0b10 << 0); CONFIG[12 + 2] &= ((0b10 << 0)| ~(0b01 << 0));
#define CFG_SET_MAME_BL3_4P_BUTTON5(CONFIG) CONFIG[11 + 2] |= (0b1 << 6); CONFIG[12 + 2] |= (0b10 << 0); CONFIG[12 + 2] &= ((0b10 << 0)| ~(0b01 << 0));
#define CFG_SET_MAME_BL3_4P_BUTTON6(CONFIG) CONFIG[11 + 2] &= ~(0b1 << 6); CONFIG[12 + 2] |= (0b11 << 0);
#define CFG_SET_MAME_BL4_LK_NOTHING(CONFIG) CONFIG[12 + 2] &= ~(0b111 << 2);
#define CFG_SET_MAME_BL4_LK_BUTTON1(CONFIG) CONFIG[12 + 2] |= (0b001 << 2); CONFIG[12 + 2] &= ((0b001 << 2)| ~(0b110 << 2));
#define CFG_SET_MAME_BL4_LK_BUTTON2(CONFIG) CONFIG[12 + 2] |= (0b010 << 2); CONFIG[12 + 2] &= ((0b010 << 2)| ~(0b101 << 2));
#define CFG_SET_MAME_BL4_LK_BUTTON3(CONFIG) CONFIG[12 + 2] |= (0b011 << 2); CONFIG[12 + 2] &= ((0b011 << 2)| ~(0b100 << 2));
#define CFG_SET_MAME_BL4_LK_BUTTON4(CONFIG) CONFIG[12 + 2] |= (0b100 << 2); CONFIG[12 + 2] &= ((0b100 << 2)| ~(0b011 << 2));
#define CFG_SET_MAME_BL4_LK_BUTTON5(CONFIG) CONFIG[12 + 2] |= (0b101 << 2); CONFIG[12 + 2] &= ((0b101 << 2)| ~(0b010 << 2));
#define CFG_SET_MAME_BL4_LK_BUTTON6(CONFIG) CONFIG[12 + 2] |= (0b110 << 2); CONFIG[12 + 2] &= ((0b110 << 2)| ~(0b001 << 2));
#define CFG_SET_MAME_BL4_MK_NOTHING(CONFIG) CONFIG[12 + 2] &= ~(0b11 << 5); CONFIG[13 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL4_MK_BUTTON1(CONFIG) CONFIG[12 + 2] |= (0b01 << 5); CONFIG[12 + 2] &= ((0b01 << 5)| ~(0b10 << 5)); CONFIG[13 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL4_MK_BUTTON2(CONFIG) CONFIG[12 + 2] |= (0b10 << 5); CONFIG[12 + 2] &= ((0b10 << 5)| ~(0b01 << 5)); CONFIG[13 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL4_MK_BUTTON3(CONFIG) CONFIG[12 + 2] |= (0b11 << 5); CONFIG[13 + 2] &= ~(0b1 << 0);
#define CFG_SET_MAME_BL4_MK_BUTTON4(CONFIG) CONFIG[12 + 2] &= ~(0b11 << 5); CONFIG[13 + 2] |= (0b1 << 0);
#define CFG_SET_MAME_BL4_MK_BUTTON5(CONFIG) CONFIG[12 + 2] |= (0b01 << 5); CONFIG[12 + 2] &= ((0b01 << 5)| ~(0b10 << 5)); CONFIG[13 + 2] |= (0b1 << 0);
#define CFG_SET_MAME_BL4_MK_BUTTON6(CONFIG) CONFIG[12 + 2] |= (0b10 << 5); CONFIG[12 + 2] &= ((0b10 << 5)| ~(0b01 << 5)); CONFIG[13 + 2] |= (0b1 << 0);
#define CFG_SET_MAME_BL4_HK_NOTHING(CONFIG) CONFIG[13 + 2] &= ~(0b111 << 1);
#define CFG_SET_MAME_BL4_HK_BUTTON1(CONFIG) CONFIG[13 + 2] |= (0b001 << 1); CONFIG[13 + 2] &= ((0b001 << 1)| ~(0b110 << 1));
#define CFG_SET_MAME_BL4_HK_BUTTON2(CONFIG) CONFIG[13 + 2] |= (0b010 << 1); CONFIG[13 + 2] &= ((0b010 << 1)| ~(0b101 << 1));
#define CFG_SET_MAME_BL4_HK_BUTTON3(CONFIG) CONFIG[13 + 2] |= (0b011 << 1); CONFIG[13 + 2] &= ((0b011 << 1)| ~(0b100 << 1));
#define CFG_SET_MAME_BL4_HK_BUTTON4(CONFIG) CONFIG[13 + 2] |= (0b100 << 1); CONFIG[13 + 2] &= ((0b100 << 1)| ~(0b011 << 1));
#define CFG_SET_MAME_BL4_HK_BUTTON5(CONFIG) CONFIG[13 + 2] |= (0b101 << 1); CONFIG[13 + 2] &= ((0b101 << 1)| ~(0b010 << 1));
#define CFG_SET_MAME_BL4_HK_BUTTON6(CONFIG) CONFIG[13 + 2] |= (0b110 << 1); CONFIG[13 + 2] &= ((0b110 << 1)| ~(0b001 << 1));
#define CFG_SET_MAME_BL4_4K_NOTHING(CONFIG) CONFIG[13 + 2] &= ~(0b111 << 4);
#define CFG_SET_MAME_BL4_4K_BUTTON1(CONFIG) CONFIG[13 + 2] |= (0b001 << 4); CONFIG[13 + 2] &= ((0b001 << 4)| ~(0b110 << 4));
#define CFG_SET_MAME_BL4_4K_BUTTON2(CONFIG) CONFIG[13 + 2] |= (0b010 << 4); CONFIG[13 + 2] &= ((0b010 << 4)| ~(0b101 << 4));
#define CFG_SET_MAME_BL4_4K_BUTTON3(CONFIG) CONFIG[13 + 2] |= (0b011 << 4); CONFIG[13 + 2] &= ((0b011 << 4)| ~(0b100 << 4));
#define CFG_SET_MAME_BL4_4K_BUTTON4(CONFIG) CONFIG[13 + 2] |= (0b100 << 4); CONFIG[13 + 2] &= ((0b100 << 4)| ~(0b011 << 4));
#define CFG_SET_MAME_BL4_4K_BUTTON5(CONFIG) CONFIG[13 + 2] |= (0b101 << 4); CONFIG[13 + 2] &= ((0b101 << 4)| ~(0b010 << 4));
#define CFG_SET_MAME_BL4_4K_BUTTON6(CONFIG) CONFIG[13 + 2] |= (0b110 << 4); CONFIG[13 + 2] &= ((0b110 << 4)| ~(0b001 << 4));
#define CFG_SET_MAME_BL4_LP_NOTHING(CONFIG) CONFIG[14 + 2] &= ~(0b111 << 0);
#define CFG_SET_MAME_BL4_LP_BUTTON1(CONFIG) CONFIG[14 + 2] |= (0b001 << 0); CONFIG[14 + 2] &= ((0b001 << 0)| ~(0b110 << 0));
#define CFG_SET_MAME_BL4_LP_BUTTON2(CONFIG) CONFIG[14 + 2] |= (0b010 << 0); CONFIG[14 + 2] &= ((0b010 << 0)| ~(0b101 << 0));
#define CFG_SET_MAME_BL4_LP_BUTTON3(CONFIG) CONFIG[14 + 2] |= (0b011 << 0); CONFIG[14 + 2] &= ((0b011 << 0)| ~(0b100 << 0));
#define CFG_SET_MAME_BL4_LP_BUTTON4(CONFIG) CONFIG[14 + 2] |= (0b100 << 0); CONFIG[14 + 2] &= ((0b100 << 0)| ~(0b011 << 0));
#define CFG_SET_MAME_BL4_LP_BUTTON5(CONFIG) CONFIG[14 + 2] |= (0b101 << 0); CONFIG[14 + 2] &= ((0b101 << 0)| ~(0b010 << 0));
#define CFG_SET_MAME_BL4_LP_BUTTON6(CONFIG) CONFIG[14 + 2] |= (0b110 << 0); CONFIG[14 + 2] &= ((0b110 << 0)| ~(0b001 << 0));
#define CFG_SET_MAME_BL4_MP_NOTHING(CONFIG) CONFIG[14 + 2] &= ~(0b111 << 3);
#define CFG_SET_MAME_BL4_MP_BUTTON1(CONFIG) CONFIG[14 + 2] |= (0b001 << 3); CONFIG[14 + 2] &= ((0b001 << 3)| ~(0b110 << 3));
#define CFG_SET_MAME_BL4_MP_BUTTON2(CONFIG) CONFIG[14 + 2] |= (0b010 << 3); CONFIG[14 + 2] &= ((0b010 << 3)| ~(0b101 << 3));
#define CFG_SET_MAME_BL4_MP_BUTTON3(CONFIG) CONFIG[14 + 2] |= (0b011 << 3); CONFIG[14 + 2] &= ((0b011 << 3)| ~(0b100 << 3));
#define CFG_SET_MAME_BL4_MP_BUTTON4(CONFIG) CONFIG[14 + 2] |= (0b100 << 3); CONFIG[14 + 2] &= ((0b100 << 3)| ~(0b011 << 3));
#define CFG_SET_MAME_BL4_MP_BUTTON5(CONFIG) CONFIG[14 + 2] |= (0b101 << 3); CONFIG[14 + 2] &= ((0b101 << 3)| ~(0b010 << 3));
#define CFG_SET_MAME_BL4_MP_BUTTON6(CONFIG) CONFIG[14 + 2] |= (0b110 << 3); CONFIG[14 + 2] &= ((0b110 << 3)| ~(0b001 << 3));
#define CFG_SET_MAME_BL4_HP_NOTHING(CONFIG) CONFIG[14 + 2] &= ~(0b1 << 6); CONFIG[15 + 2] &= ~(0b11 << 0);
#define CFG_SET_MAME_BL4_HP_BUTTON1(CONFIG) CONFIG[14 + 2] |= (0b1 << 6); CONFIG[15 + 2] &= ~(0b11 << 0);
#define CFG_SET_MAME_BL4_HP_BUTTON2(CONFIG) CONFIG[14 + 2] &= ~(0b1 << 6); CONFIG[15 + 2] |= (0b01 << 0); CONFIG[15 + 2] &= ((0b01 << 0)| ~(0b10 << 0));
#define CFG_SET_MAME_BL4_HP_BUTTON3(CONFIG) CONFIG[14 + 2] |= (0b1 << 6); CONFIG[15 + 2] |= (0b01 << 0); CONFIG[15 + 2] &= ((0b01 << 0)| ~(0b10 << 0));
#define CFG_SET_MAME_BL4_HP_BUTTON4(CONFIG) CONFIG[14 + 2] &= ~(0b1 << 6); CONFIG[15 + 2] |= (0b10 << 0); CONFIG[15 + 2] &= ((0b10 << 0)| ~(0b01 << 0));
#define CFG_SET_MAME_BL4_HP_BUTTON5(CONFIG) CONFIG[14 + 2] |= (0b1 << 6); CONFIG[15 + 2] |= (0b10 << 0); CONFIG[15 + 2] &= ((0b10 << 0)| ~(0b01 << 0));
#define CFG_SET_MAME_BL4_HP_BUTTON6(CONFIG) CONFIG[14 + 2] &= ~(0b1 << 6); CONFIG[15 + 2] |= (0b11 << 0);
#define CFG_SET_MAME_BL4_4P_NOTHING(CONFIG) CONFIG[15 + 2] &= ~(0b111 << 2);
#define CFG_SET_MAME_BL4_4P_BUTTON1(CONFIG) CONFIG[15 + 2] |= (0b001 << 2); CONFIG[15 + 2] &= ((0b001 << 2)| ~(0b110 << 2));
#define CFG_SET_MAME_BL4_4P_BUTTON2(CONFIG) CONFIG[15 + 2] |= (0b010 << 2); CONFIG[15 + 2] &= ((0b010 << 2)| ~(0b101 << 2));
#define CFG_SET_MAME_BL4_4P_BUTTON3(CONFIG) CONFIG[15 + 2] |= (0b011 << 2); CONFIG[15 + 2] &= ((0b011 << 2)| ~(0b100 << 2));
#define CFG_SET_MAME_BL4_4P_BUTTON4(CONFIG) CONFIG[15 + 2] |= (0b100 << 2); CONFIG[15 + 2] &= ((0b100 << 2)| ~(0b011 << 2));
#define CFG_SET_MAME_BL4_4P_BUTTON5(CONFIG) CONFIG[15 + 2] |= (0b101 << 2); CONFIG[15 + 2] &= ((0b101 << 2)| ~(0b010 << 2));
#define CFG_SET_MAME_BL4_4P_BUTTON6(CONFIG) CONFIG[15 + 2] |= (0b110 << 2); CONFIG[15 + 2] &= ((0b110 << 2)| ~(0b001 << 2));

#endif
